<?php

return [
    'otp_code' => 'رمز OTP',

    'mail' => [
        'subject' => 'رمز OTP',
        'greeting' => 'مرحبًا!',
        'line1' => 'رمز OTP الخاص بك هو: :code',
        'line2' => 'سيكون هذا الرمز صالحًا لمدة :seconds ثانية.',
        'line3' => 'إذا لم تكن قد طلبت رمزًا، يُرجى تجاهل هذا البريد الإلكتروني.',
        'salutation' => 'مع أطيب التحيات، :app_name',
        'alert_text' =>  'يسعدنا انضمامك إلينا. لتفعيل حسابك بشكل كامل والاستمتاع بجميع الميزات الحصرية، يرجى التحقق من بريدك الإلكتروني  ',
    ],

    'view' => [
        'time_left' => 'الوقت المتبقي: ثوانٍ',
        'resend_code' => 'إعادة إرسال الرمز',
        'send_code' => 'إرسال الرمز',
        'verify' => 'التحقق',
        'go_back' => 'العودة',
        'change_phone_number' => 'تغير رقم التلفون',
    ],

    'notifications' => [
        'title' => ' إرسال رمز OTP',
        'body' => 'تم إرسال رمز التحقق إلى عنوان بريدك الإلكتروني   :to   سيكون صالحًا لمدة :seconds ثانية.',
        'sms_text' => 'تم إرسال رمز التحقق برسالة نصية إلى رقم تلفونك :to  سيكون صالحًا لمدة :seconds ثانية ',
    ],

    'validation' => [
        'invalid_code' => 'الرمز الذي أدخلته غير صحيح.',
        'expired_code' => 'الرمز الذي أدخلته منتهي الصلاحية.',
        'temporarily_disabled' => '  نعمل جاهدين لحماية حسابك. تم تعليق طلبات رمز التحقق مؤقتًا بسبب عدة محاولات تسجيل دخول غير صحيحة. يمكنك إعادة المحاولة  :time . نشكرك على صبرك.',
    ],
];
